OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f917.h
extern __at(0x0112) __sfr LCDDATA2;

typedef union
  {
  struct
    {
    unsigned SEG16              : 1;
    unsigned SEG17              : 1;
    unsigned SEG18              : 1;
    unsigned SEG19              : 1;
    unsigned SEG20              : 1;
    unsigned SEG21              : 1;
    unsigned SEG22              : 1;
    unsigned SEG23              : 1;
    };

  struct
    {
    unsigned SEG16COM0          : 1;
    unsigned SEG17COM0          : 1;
    unsigned SEG18COM0          : 1;
    unsigned SEG19COM0          : 1;
    unsigned SEG20COM0          : 1;
    unsigned SEG21COM0          : 1;
    unsigned SEG22COM0          : 1;
    unsigned SEG23COM0          : 1;
    };

  struct
    {
    unsigned S16C0              : 1;
    unsigned S17C0              : 1;
    unsigned S18C0              : 1;
    unsigned S19C0              : 1;
    unsigned S20C0              : 1;
    unsigned S21C0              : 1;
    unsigned S22C0              : 1;
    unsigned S23C0              : 1;
    };
  } __LCDDATA2bits_t;

extern __at(0x0112) volatile __LCDDATA2bits_t LCDDATA2bits;

#define _SEG16                  0x01
#define _SEG16COM0              0x01
#define _S16C0                  0x01
#define _SEG17                  0x02
#define _SEG17COM0              0x02
#define _S17C0                  0x02
#define _SEG18                  0x04
#define _SEG18COM0              0x04
#define _S18C0                  0x04
#define _SEG19                  0x08
#define _SEG19COM0              0x08
#define _S19C0                  0x08
#define _SEG20                  0x10
#define _SEG20COM0              0x10
#define _S20C0                  0x10
#define _SEG21                  0x20
#define _SEG21COM0              0x20
#define _S21C0                  0x20
#define _SEG22                  0x40
#define _SEG22COM0              0x40
#define _S22C0                  0x40
#define _SEG23                  0x80
#define _SEG23COM0              0x80
#define _S23C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA3 Bits

extern __at(0x0113) __sfr LCDDATA3;

typedef union
  {
  struct
    {
    unsigned SEG0               : 1;
    unsigned SEG1               : 1;
    unsigned SEG2               : 1;
    unsigned SEG3               : 1;
    unsigned SEG4               : 1;
    unsigned SEG5               : 1;
    unsigned SEG6               : 1;
    unsigned SEG7               : 1;
    };

  struct
    {
    unsigned SEG0COM1           : 1;
    unsigned SEG1COM1           : 1;
    unsigned SEG2COM1           : 1;
    unsigned SEG3COM1           : 1;
    unsigned SEG4COM1           : 1;
    unsigned SEG5COM1           : 1;
    unsigned SEG6COM1           : 1;
    unsigned SEG7COM1           : 1;
    };

  struct
    {
    unsigned S0C1               : 1;
    unsigned S1C1               : 1;
    unsigned S2C1               : 1;
    unsigned S3C1               : 1;
    unsigned S4C1               : 1;
    unsigned S5C1               : 1;
    unsigned S6C1               : 1;
    unsigned S7C1               : 1;
    };
  } __LCDDATA3bits_t;

extern __at(0x0113) volatile __LCDDATA3bits_t LCDDATA3bits;

#define _LCDDATA3_SEG0          0x01
#define _LCDDATA3_SEG0COM1      0x01
#define _LCDDATA3_S0C1          0x01
#define _LCDDATA3_SEG1          0x02
#define _LCDDATA3_SEG1COM1      0x02
#define _LCDDATA3_S1C1          0x02
#define _LCDDATA3_SEG2          0x04
#define _LCDDATA3_SEG2COM1      0x04
#define _LCDDATA3_S2C1          0x04
#define _LCDDATA3_SEG3          0x08
#define _LCDDATA3_SEG3COM1      0x08
#define _LCDDATA3_S3C1          0x08
#define _LCDDATA3_SEG4          0x10
#define _LCDDATA3_SEG4COM1      0x10
#define _LCDDATA3_S4C1          0x10
#define _LCDDATA3_SEG5          0x20
#define _LCDDATA3_SEG5COM1      0x20
#define _LCDDATA3_S5C1          0x20
#define _LCDDATA3_SEG6          0x40
#define _LCDDATA3_SEG6COM1      0x40
#define _LCDDATA3_S6C1          0x40
#define _LCDDATA3_SEG7          0x80
#define _LCDDATA3_SEG7COM1      0x80
#define _LCDDATA3_S7C1          0x80

//==============================================================================


//==============================================================================
//        LCDDATA4 Bits

extern __at(0x0114) __sfr LCDDATA4;

typedef union
  {
  struct
    {
    unsigned SEG8               : 1;
    unsigned SEG9               : 1;
    unsigned SEG10              : 1;
    unsigned SEG11              : 1;
    unsigned SEG12              : 1;
    unsigned SEG13              : 1;
    unsigned SEG14              : 1;
    unsigned SEG15              : 1;
    };

  struct
    {
    unsigned SEG8COM1           : 1;
    unsigned SEG9COM1           : 1;
    unsigned SEG10COM1          : 1;
    unsigned SEG11COM1          : 1;
    unsigned SEG12COM1          : 1;
    unsigned SEG13COM1          : 1;
    unsigned SEG14COM1          : 1;
    unsigned SEG15COM1          : 1;
    };

  struct
    {
    unsigned S8C1               : 1;
    unsigned S9C1               : 1;
    unsigned S10C1              : 1;
    unsigned S11C1              : 1;
    unsigned S12C1              : 1;
    unsigned S13C1              : 1;
    unsigned S14C1              : 1;
    unsigned S15C1              : 1;
    };
  } __LCDDATA4bits_t;

extern __at(0x0114) volatile __LCDDATA4bits_t LCDDATA4bits;

#define _LCDDATA4_SEG8          0x01
#define _LCDDATA4_SEG8COM1      0x01
#define _LCDDATA4_S8C1          0x01
#define _LCDDATA4_SEG9          0x02
#define _LCDDATA4_SEG9COM1      0x02
#define _LCDDATA4_S9C1          0x02
#define _LCDDATA4_SEG10         0x04
#define _LCDDATA4_SEG10COM1     0x04
#define _LCDDATA4_S10C1         0x04
#define _LCDDATA4_SEG11         0x08
#define _LCDDATA4_SEG11COM1     0x08
#define _LCDDATA4_S11C1         0x08
#define _LCDDATA4_SEG12         0x10
#define _LCDDATA4_SEG12COM1     0x10
#define _LCDDATA4_S12C1         0x10
#define _LCDDATA4_SEG13         0x20
#define _LCDDATA4_SEG13COM1     0x20
#define _LCDDATA4_S13C1         0x20
#define _LCDDATA4_SEG14         0x40
#define _LCDDATA4_SEG14COM1     0x40
#define _LCDDATA4_S14C1         0x40
#define _LCDDATA4_SEG15         0x80
#define _LCDDATA4_SEG15COM1     0x80
#define _LCDDATA4_S15C1         0x80

//==============================================================================


//==============================================================================
//        LCDDATA5 Bits

extern __at(0x0115) __sfr LCDDATA5;

typedef union
  {
  struct
    {
    unsigned SEG16              : 1;
    unsigned SEG17              : 1;
    unsigned SEG18              : 1;
    unsigned SEG19              : 1;
    unsigned SEG20              : 1;
    unsigned SEG21              : 1;
    unsigned SEG22              : 1;
    unsigned SEG23              : 1;
    };

  struct
    {
    unsigned SEG16COM1          : 1;
    unsigned SEG17COM1          : 1;
    unsigned SEG18COM1          : 1;
    unsigned SEG19COM1          : 1;
    unsigned SEG20COM1          : 1;
    unsigned SEG21COM1          : 1;
    unsigned SEG22COM1          : 1;
    unsigned SEG23COM1          : 1;
    };

  struct
    {
    unsigned S16C1              : 1;
    unsigned S17C1              : 1;
    unsigned S18C1              : 1;
    unsigned S19C1              : 1;
    unsigned S20C1              : 1;
    unsigned S21C1              : 1;
    unsigned S22C1              : 1;
    unsigned S23C1              : 1;
    };
  } __LCDDATA5bits_t;

