OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f917.h
extern __at(0x011A) volatile __LCDDATA10bits_t LCDDATA10bits;

#define _LCDDATA10_SEG8         0x01
#define _LCDDATA10_SEG8COM3     0x01
#define _LCDDATA10_S8C3         0x01
#define _LCDDATA10_SEG9         0x02
#define _LCDDATA10_SEG9COM3     0x02
#define _LCDDATA10_S9C3         0x02
#define _LCDDATA10_SEG10        0x04
#define _LCDDATA10_SEG10COM3    0x04
#define _LCDDATA10_S10C3        0x04
#define _LCDDATA10_SEG11        0x08
#define _LCDDATA10_SEG11COM3    0x08
#define _LCDDATA10_S11C3        0x08
#define _LCDDATA10_SEG12        0x10
#define _LCDDATA10_SEG12COM3    0x10
#define _LCDDATA10_S12C3        0x10
#define _LCDDATA10_SEG13        0x20
#define _LCDDATA10_SEG13COM3    0x20
#define _LCDDATA10_S13C3        0x20
#define _LCDDATA10_SEG14        0x40
#define _LCDDATA10_SEG14COM3    0x40
#define _LCDDATA10_S14C3        0x40
#define _LCDDATA10_SEG15        0x80
#define _LCDDATA10_SEG15COM3    0x80
#define _LCDDATA10_S15C3        0x80

//==============================================================================


//==============================================================================
//        LCDDATA11 Bits

extern __at(0x011B) __sfr LCDDATA11;

typedef union
  {
  struct
    {
    unsigned SEG16              : 1;
    unsigned SEG17              : 1;
    unsigned SEG18              : 1;
    unsigned SEG19              : 1;
    unsigned SEG20              : 1;
    unsigned SEG21              : 1;
    unsigned SEG22              : 1;
    unsigned SEG23              : 1;
    };

  struct
    {
    unsigned SEG16COM3          : 1;
    unsigned SEG17COM3          : 1;
    unsigned SEG18COM3          : 1;
    unsigned SEG19COM3          : 1;
    unsigned SEG20COM3          : 1;
    unsigned SEG21COM3          : 1;
    unsigned SEG22COM3          : 1;
    unsigned SEG23COM3          : 1;
    };

  struct
    {
    unsigned S16C3              : 1;
    unsigned S17C3              : 1;
    unsigned S18C3              : 1;
    unsigned S19C3              : 1;
    unsigned S20C3              : 1;
    unsigned S21C3              : 1;
    unsigned S22C3              : 1;
    unsigned S23C3              : 1;
    };
  } __LCDDATA11bits_t;

extern __at(0x011B) volatile __LCDDATA11bits_t LCDDATA11bits;

#define _LCDDATA11_SEG16        0x01
#define _LCDDATA11_SEG16COM3    0x01
#define _LCDDATA11_S16C3        0x01
#define _LCDDATA11_SEG17        0x02
#define _LCDDATA11_SEG17COM3    0x02
#define _LCDDATA11_S17C3        0x02
#define _LCDDATA11_SEG18        0x04
#define _LCDDATA11_SEG18COM3    0x04
#define _LCDDATA11_S18C3        0x04
#define _LCDDATA11_SEG19        0x08
#define _LCDDATA11_SEG19COM3    0x08
#define _LCDDATA11_S19C3        0x08
#define _LCDDATA11_SEG20        0x10
#define _LCDDATA11_SEG20COM3    0x10
#define _LCDDATA11_S20C3        0x10
#define _LCDDATA11_SEG21        0x20
#define _LCDDATA11_SEG21COM3    0x20
#define _LCDDATA11_S21C3        0x20
#define _LCDDATA11_SEG22        0x40
#define _LCDDATA11_SEG22COM3    0x40
#define _LCDDATA11_S22C3        0x40
#define _LCDDATA11_SEG23        0x80
#define _LCDDATA11_SEG23COM3    0x80
#define _LCDDATA11_S23C3        0x80

//==============================================================================


//==============================================================================
//        LCDSE0 Bits

extern __at(0x011C) __sfr LCDSE0;

typedef union
  {
  struct
    {
    unsigned SEG0               : 1;
    unsigned SEG1               : 1;
    unsigned SEG2               : 1;
    unsigned SEG3               : 1;
    unsigned SEG4               : 1;
    unsigned SEG5               : 1;
    unsigned SEG6               : 1;
    unsigned SEG7               : 1;
    };

  struct
    {
    unsigned SE0                : 1;
    unsigned SE1                : 1;
    unsigned SE2                : 1;
    unsigned SE3                : 1;
    unsigned SE4                : 1;
    unsigned SE5                : 1;
    unsigned SE6                : 1;
    unsigned SE7                : 1;
    };

  struct
    {
    unsigned SEGEN0             : 1;
    unsigned SEGEN1             : 1;
    unsigned SEGEN2             : 1;
    unsigned SEGEN3             : 1;
    unsigned SEGEN4             : 1;
    unsigned SEGEN5             : 1;
    unsigned SEGEN6             : 1;
    unsigned SEGEN7             : 1;
    };
  } __LCDSE0bits_t;

extern __at(0x011C) volatile __LCDSE0bits_t LCDSE0bits;

#define _LCDSE0_SEG0            0x01
#define _LCDSE0_SE0             0x01
#define _LCDSE0_SEGEN0          0x01
#define _LCDSE0_SEG1            0x02
#define _LCDSE0_SE1             0x02
#define _LCDSE0_SEGEN1          0x02
#define _LCDSE0_SEG2            0x04
#define _LCDSE0_SE2             0x04
#define _LCDSE0_SEGEN2          0x04
#define _LCDSE0_SEG3            0x08
#define _LCDSE0_SE3             0x08
#define _LCDSE0_SEGEN3          0x08
#define _LCDSE0_SEG4            0x10
#define _LCDSE0_SE4             0x10
#define _LCDSE0_SEGEN4          0x10
#define _LCDSE0_SEG5            0x20
#define _LCDSE0_SE5             0x20
#define _LCDSE0_SEGEN5          0x20
#define _LCDSE0_SEG6            0x40
#define _LCDSE0_SE6             0x40
#define _LCDSE0_SEGEN6          0x40
#define _LCDSE0_SEG7            0x80
#define _LCDSE0_SE7             0x80
#define _LCDSE0_SEGEN7          0x80

//==============================================================================


//==============================================================================
//        LCDSE1 Bits

extern __at(0x011D) __sfr LCDSE1;

typedef union
  {
  struct
    {
    unsigned SEG8               : 1;
    unsigned SEG9               : 1;
    unsigned SEG10              : 1;
    unsigned SEG11              : 1;
    unsigned SEG12              : 1;
    unsigned SEG13              : 1;
    unsigned SEG14              : 1;
    unsigned SEG15              : 1;
    };

  struct
    {
    unsigned SE8                : 1;
    unsigned SE9                : 1;
    unsigned SE10               : 1;
    unsigned SE11               : 1;
    unsigned SE12               : 1;
    unsigned SE13               : 1;
    unsigned SE14               : 1;
    unsigned SE15               : 1;
    };

  struct
    {
    unsigned SEGEN8             : 1;
    unsigned SEGEN9             : 1;
    unsigned SEGEN10            : 1;
    unsigned SEGEN11            : 1;
    unsigned SEGEN12            : 1;
    unsigned SEGEN13            : 1;
    unsigned SEGEN14            : 1;
    unsigned SEGEN15            : 1;
    };
  } __LCDSE1bits_t;

extern __at(0x011D) volatile __LCDSE1bits_t LCDSE1bits;

#define _LCDSE1_SEG8            0x01
#define _LCDSE1_SE8             0x01
#define _LCDSE1_SEGEN8          0x01
#define _LCDSE1_SEG9            0x02
#define _LCDSE1_SE9             0x02
#define _LCDSE1_SEGEN9          0x02
#define _LCDSE1_SEG10           0x04
#define _LCDSE1_SE10            0x04
#define _LCDSE1_SEGEN10         0x04
#define _LCDSE1_SEG11           0x08
#define _LCDSE1_SE11            0x08
#define _LCDSE1_SEGEN11         0x08
#define _LCDSE1_SEG12           0x10
#define _LCDSE1_SE12            0x10
#define _LCDSE1_SEGEN12         0x10
#define _LCDSE1_SEG13           0x20
#define _LCDSE1_SE13            0x20
#define _LCDSE1_SEGEN13         0x20
#define _LCDSE1_SEG14           0x40
#define _LCDSE1_SE14            0x40
#define _LCDSE1_SEGEN14         0x40
#define _LCDSE1_SEG15           0x80
#define _LCDSE1_SE15            0x80
#define _LCDSE1_SEGEN15         0x80

//==============================================================================


//==============================================================================
//        LCDSE2 Bits

extern __at(0x011E) __sfr LCDSE2;

typedef union
  {
  struct
    {
    unsigned SEG16              : 1;
    unsigned SEG17              : 1;
    unsigned SEG18              : 1;
    unsigned SEG19              : 1;
    unsigned SEG20              : 1;
    unsigned SEG21              : 1;
    unsigned SEG22              : 1;
    unsigned SEG23              : 1;
    };

  struct
    {
    unsigned SE16               : 1;
    unsigned SE17               : 1;
    unsigned SE18               : 1;
    unsigned SE19               : 1;
    unsigned SE20               : 1;
    unsigned SE21               : 1;
    unsigned SE22               : 1;
    unsigned SE23               : 1;
    };

  struct
    {
    unsigned SEGEN16            : 1;
    unsigned SEGEN17            : 1;
    unsigned SEGEN18            : 1;
    unsigned SEGEN19            : 1;
    unsigned SEGEN20            : 1;
    unsigned SEGEN21            : 1;
    unsigned SEGEN22            : 1;
    unsigned SEGEN23            : 1;
    };
  } __LCDSE2bits_t;

